In [1]:
import pandas as pd
import numpy as np

In [3]:
data = np.random.randn(4,3)

In [4]:
data

array([[ 0.83015307,  0.41210866, -1.00931821],
       [-0.00840904, -0.43658681,  0.82872254],
       [-0.24311025, -0.81062433,  0.82737694],
       [-0.09095551,  0.93196837, -1.40198441]])

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame

          0         1         2
0  0.830153  0.412109 -1.009318
1 -0.008409 -0.436587  0.828723
2 -0.243110 -0.810624  0.827377
3 -0.090956  0.931968 -1.401984

In [7]:
dataFrame[0]

0    0.830153
1   -0.008409
2   -0.243110
3   -0.090956
Name: 0, dtype: float64

In [9]:
newDataFrame = pd.DataFrame(data,index=["Mert","Elif","Melek","Mustafa"],columns = ["Price","Age","Hour"])

In [10]:
newDataFrame

            Price       Age      Hour
Mert     0.830153  0.412109 -1.009318
Elif    -0.008409 -0.436587  0.828723
Melek   -0.243110 -0.810624  0.827377
Mustafa -0.090956  0.931968 -1.401984

In [11]:
newDataFrame["Age"]

Mert       0.412109
Elif      -0.436587
Melek     -0.810624
Mustafa    0.931968
Name: Age, dtype: float64

In [12]:
newDataFrame[["Price","Age"]]

            Price       Age
Mert     0.830153  0.412109
Elif    -0.008409 -0.436587
Melek   -0.243110 -0.810624
Mustafa -0.090956  0.931968

In [13]:
newDataFrame.loc["Mert"]

Price    0.830153
Age      0.412109
Hour    -1.009318
Name: Mert, dtype: float64

In [15]:
newDataFrame.iloc[1]

Price   -0.008409
Age     -0.436587
Hour     0.828723
Name: Elif, dtype: float64

## Index

In [16]:
newDataFrame["Total"] = newDataFrame["Age"] * newDataFrame["Hour"]

In [17]:
newDataFrame

            Price       Age      Hour     Total
Mert     0.830153  0.412109 -1.009318 -0.415949
Elif    -0.008409 -0.436587  0.828723 -0.361809
Melek   -0.243110 -0.810624  0.827377 -0.670692
Mustafa -0.090956  0.931968 -1.401984 -1.306605

In [18]:
newDataFrame.drop("Total", axis = 1)

            Price       Age      Hour
Mert     0.830153  0.412109 -1.009318
Elif    -0.008409 -0.436587  0.828723
Melek   -0.243110 -0.810624  0.827377
Mustafa -0.090956  0.931968 -1.401984

In [19]:
newDataFrame.drop("Mustafa", axis = 0)

          Price       Age      Hour     Total
Mert   0.830153  0.412109 -1.009318 -0.415949
Elif  -0.008409 -0.436587  0.828723 -0.361809
Melek -0.243110 -0.810624  0.827377 -0.670692

In [21]:
newDataFrame.drop("Total", axis = 1, inplace = True)

In [22]:
newDataFrame

            Price       Age      Hour
Mert     0.830153  0.412109 -1.009318
Elif    -0.008409 -0.436587  0.828723
Melek   -0.243110 -0.810624  0.827377
Mustafa -0.090956  0.931968 -1.401984

In [24]:
newDataFrame.loc["Mert"]["Age"]

0.41210866398024415

In [25]:
newDataFrame.loc["Mert","Age"]

0.41210866398024415

In [27]:
booleanFrame = newDataFrame < 0

In [28]:
booleanFrame

         Price    Age   Hour
Mert     False  False   True
Elif      True   True  False
Melek     True   True  False
Mustafa   True  False   True

In [29]:
newDataFrame[booleanFrame]

            Price       Age      Hour
Mert          NaN       NaN -1.009318
Elif    -0.008409 -0.436587       NaN
Melek   -0.243110 -0.810624       NaN
Mustafa -0.090956       NaN -1.401984

In [30]:
newDataFrame[newDataFrame < 0]

            Price       Age      Hour
Mert          NaN       NaN -1.009318
Elif    -0.008409 -0.436587       NaN
Melek   -0.243110 -0.810624       NaN
Mustafa -0.090956       NaN -1.401984

In [32]:
newDataFrame[newDataFrame["Age"] > 0]

            Price       Age      Hour
Mert     0.830153  0.412109 -1.009318
Mustafa -0.090956  0.931968 -1.401984